# CH1. 컴퓨터 네트워크와 인터넷

## 1.1 인터넷이란 무엇인가?

공중 인터넷??

여튼 이걸 가지고 컴퓨터 네트워크와 프로토콜을 살펴보기 위한 주요 수단으로 사용

1. 기본적인 하드웨어와 소프트웨어 구성요소를 기술하는 것
2. 분산 애플리케이션에 서비스를 제공하는 네트워킹 인프라스트럭처 관점에서 보기

![1000000641.jpg](attachment:f32a2911-2e47-4209-8715-2713dbc4b133:1000000641.jpg)

### 1.1.1 구성요소로 본 인터넷

= 수십억 개의 컴퓨팅 장치를 연결하는 **컴퓨터 네트워크** 

과거, 소위 말하는 서버들 (일반 데톱 PC, 리눅스 워크스테이션 등)

현재, 비전통적인 인터넷 사물들 (자동온도조절기, 홈보안시스템 등)

⇒ 이러한 모든 장치는 호스트(host) 혹은 종단시스템(end system)이라 불림

- 종단 시스템 = 통신링크 (communication link) & 패킷 스위치(packet switch)
- 초당 비트수 : bps(bit per second)
- 종단 to 종단
    - 패킷 : 데이터를 segment로 나눈 후 header를 붙임
    - 목적지에서 원래의 데이터로 다시 조립
